#include<iostream>
using namespace std;
void reverse(int* pointer_1, int* pointer_2) { // Функция осуществляющая переворот значений
	int buf = *pointer_1;
	*pointer_1 = *pointer_2;
	*pointer_2 = buf;
}
void main() {
	setlocale(LC_ALL, "rus"); // установка кириллицы
	int a = 0, b = 0; int* pointerA = &a, *pointerB = &b;
	cout << "Введите А ="; cin >> a; // ввод "a"
	cout << "Введите Б ="; cin >> b; // ввод "б"
	////////Вывод первоначальных значений///////////////////////////////
	cout << "\t\t\tДо:\n";
	cout << "Адрес А = " << &a;
	cout << "\nАдрес указателя на переменную А = "<<&pointerA; 
	cout << "\nАдрес Б = " << &b;
	cout << "\nАдрес указателя на Б = " << &pointerB;
	cout << "\nЗначение A = "; printf("\x1B[31m%d\033[0m", a); // небольшая игра с цветом(изюминка)
	cout << "\nЗначение Б = "; printf("\x1B[32m%d\033[0m", b);
	////////////////////////////////////////////////////////////////////
	reverse(pointerA, pointerB); // вызов пользовательской функции
	/////////Вывод изменённых значений//////////////////////////////////
	cout << "\n\n\n\n";
	cout << "\t\t\tПосле:\n";
	cout << "Адрес А = " << &a;
	cout << "\nАдрес указателя на переменную А = " << &pointerA;
	cout << "\nАдрес Б = " << &b;
	cout << "\nАдрес указателя на Б = " << &pointerB;
	cout << "\nЗначение A = "; printf("\x1B[32m%d\033[0m", a);
	cout << "\nЗначение Б = "; printf("\x1B[31m%d\033[0m", b);
	////////////////////////////////////////////////////////////////////

}